Repository: Aguay-val/passhport
Catalog: docs/po/*/LC_MESSAGES/installation-and-configuration/use-mysql-mariadb-*-backend.po
Languages: fr

source: Use MySQL as database backend
fr: Utiliser MySQL comme base de données

source: Install PyMySQL python module
fr: Installer le module python PyMySQL

source: If you did not use the packaged version of passhport (deb/rpm), proceed as follow. If you used the package version, go directly below, to the `MySQL configuration`_.
fr: Si vous n'avez pas utilisé la version paqueté de PaSSHport (dep/rpm), procédez comme suit. Si vous avez utilisé la version packagée, aller directement à la section `Configuration de MySQL`_.

source: If you want to use MySQL as the database backend you'll need to add a python module : PyMySQL.
fr: Si vous voulez utilisez MySQL comme base de données, vous devez installer le module python *PyMySQL*.

source: As passhport user, install PyMySQL :
fr: En tant qu'utilisateur passhport, on installe PyMySQL :

source: MySQL configuration
fr: Configuration de MySQL

source: Create a *passhport* database in you MySQL server (may be different on your distro, this is just an example) :
fr: Créez une base de données *passhport* dans MySQL (la méthode peut varier selon votre distribution) :

source: Then create a user that'll have all rights on the *passhport* database :
fr: Créez ensuite un utilisateur qui aura tous les droits sur la base de données *passhport* :

source: passhportd configuration
fr: Configuration de passhportd

source: Change the configuration of the *passhportd.ini* file (``/etc/passhport/passhportd.ini``). You need to change the ``SQLALCHEMY_DATABASE_URI`` parameter to :
fr: On modifie le fichier de configuration *passhportd.ini*(``/etc/passhport/passhportd.ini``). On change le paramètre ``SQLALCHEMY_DATABASE_URI`` :

source: As passhport (system) user, initialize the database :
fr: En tant qu'utilisateur passhport (celui du system, pas celui de MySQL), on initialise la base de données :

source: Re-launch passhportd (as root) :
fr: On relance passhportd (en tant que root) :

source: PaSSHport now use MySQL backend.
fr: PaSSHport utilise désormais MySQL.
