Repository: Aguay-val/passhport
Catalog: docs/po/*/LC_MESSAGES/introduction.po
Languages: fr

source: Introduction to PaSSHport
fr: Introduction à PaSSHport

source: PaSSHport is a software that allows you to control the SSH access of your IT components : Linux/Unix servers, network switchs, routers, WiFi access points, and any appliances that is accessed by SSH. In three words : who accesses what ?
fr: PaSSHport est un logiciel qui vous permet de contrôler les accès SSH des briques de votre IT : serveurs Linux/Unix, switchs réseaux, routeurs, points d'accès WiFi, ainsi que n'importe quelle brique accessible via SSH. En quatre mots : qui a accès à quoi ?

source: PaSSHport has been written with the following in mind :
fr: PaSSHport a été écrit avec les objectifs suivants :

source: Similar to `SSHgate <https://github.com/Tauop/sshGate>`_
fr: Similaire à `SSHgate <https://github.com/Tauop/sshGate>`_

source: Two main objects : targets and users (we'll see below what are those)
fr: Deux types d'objects : targets et users (Nous verrons ça un peu plus bas)

source: Objects can be grouped : targetgroups and usergroups
fr: Les objects peuvent être groupés

source: Record all sessions of users
fr: Enregistrer toutes les sessions des utilisateurs

source: Can be fully configure and used from the command line interface
fr: Être entièrement configurable et utilisé depuis la ligne de commandes

source: Can do Secured Copy (scp)
fr: Possibilité de faire des copy sécurisées (scp)

source: REST API based communication between components so that it can be easily integrated in an automated IT environment
fr: Des communications entre les composants basées sur une API REST, pour une intégration plus aisée dans un IT automatisé

source: Use only OpenSource technologies
fr: Utiliser seulement (ou principalement) des technologies OpenSource

source: Please read below to understand the main components, and how they work together.
fr: Pour comprendre les composants principaux, et comment ils interagissent entre eux, veuillez lire ce qui suit.

source: Components
fr: Composants

source: PaSSHport project is composed with 3 main programs :
fr: PaSSHport est composé de 3 programmes :

source: passhportd : the daemon that verify access rights, and store configuration
fr: passhportd : le démon qui enregistrent, et vérifie la configuration

source: passhport : the script that receive the connection (it does NOT replace the SSH server). Think of it has the shell a user falls into when connecting to a PaSSHport gateway
fr: passhport : le script qui reçoit les connexions (il ne remplace PAS un serveur SSH). Il faut le voir comme le shell sur lequel les utilisateurs arrivent quand ils se connectent à PaSSHport.

source: passhport-admin : the script that is used to configure passhportd. SysAdmins will use it to add a *user*, a *target*, a *usergroup*, a *targetgroup*, and combine those to configure accesses
fr: passhport-admin : le script qui permet de configurer passhportd. Les adminSys l'utilisent pour, par exemple, ajouter un *user*, une *target*, un *usergroup*, un *targetgroup*, et combiner ces derniers pour configurer les accès

source: Now let's go to the installation process…
fr: Et maintenant, passons à l'installation…
